import React from "react";
import "./formBuilder.scss";
import FormBuilderImg from "../../../assets/images/FormBuilder.jpg";
import AsideTitle from "../../common/AsideTitle";
import SectionProperties from "../../common/SectionProperties";

const FormBuilder = () => {
  return (
    <div className="FormBuilder_container">
      <div className="formbuilder">
        <h2>
          فرم‌ساز <span>پیشرفته</span>
        </h2>
        <span>اطمینان از صحت اطلاعات در ساختار ایجاد شده</span>
        <p>
          امروزه بخش قابل توجهی از اسناد در قالب فرم‌‌‌‌‏های اطلاعاتی هستند.
          ثبت، نگهداری و بازیابی اطلاعات این فرم‌ها از اهمیت ویژه‌ای برخوردار
          است. راهکار فرم‌‌‌‌‏ساز جهت پاسخگویی به این نیاز طراحی و ارائه شده
          است. با استفاده از ابزار فرم‌‌‌‌‏ساز کاربر بدون دانش برنامه‌نویسی
          می‌تواند فرم‌ها را به راحتی در سیستم طراحی کرده و اطلاعات جمع
          ‌‌‌‌‌‏آوری شده را تحلیل و بررسی نماید.
        </p>
        <img src={FormBuilderImg} />
      </div>
      <div className="list">
        <div className="title">
          <AsideTitle title={"مزایای ابزار فرم‌ساز پیشرفته"} />
        </div>
        <span>به کار گیری این سیستم موجب:</span>
        <ul>
          <li>
            بهبـود‌ كارايـــــي‌ و افزايــش ‌بـــهره‌وري ‌و‌ رضايـــت ‌كاركنان
          </li>
          <li>
            افزایش سرعت ثبت و نگهداری اطلاعات فرم های مختلف به صورت الکترونیکی
            کمک
          </li>
          <li>
            به پیـــــاده سازی آســــــان قوانیــن و مجــوزها قابلیت پشتیبانی از
          </li>
          <li>
            بهبود و امکان ایجاد نگارش جدید بر روی فرم ها طبق نیازهای مخاطبین
          </li>
          <li>
            امـــــکان پیـــــش نمایش فرم در زمــــان طراحی امکان طراحی نامحدود
          </li>
          <li>
            فیلدهای یک فرم اطلاعاتی امــــکان ویرایــــش کـــــــــــد HTML
          </li>
          <li>
            فـــــرم ها، امــــکان اعـــــمال CSS در طــــــراحی فــــــــرم
            امکان
          </li>
          <li>
            تعریف فیلدهای وابـــــسته به جـــداول دیگر امــــــکان تعـــــــریف
          </li>
          <li>
            فیلــــــد های محاســــباتی امــــــکان تعـــــــــریف فـــــرم
          </li>
          <li>
            هــــــای تو در تو امـــکان چاپ فــــرم با الگوهای از قبل تعریف شده
          </li>
          <li>اعتبار ســــنجی فیلد های فرم در زمان ورود اطلاعات امـــکان</li>
          <li>
            استـــــفاده از اطلاعات فـــــرم‌های دیگر در طراحی فرم امکان
            تعــــریف
          </li>
          <li>
            انــــــواع فیــــــــلد های اطلاعاتــــــــی امکان تعریف امکان
            ویرایش
          </li>
          <li>
            و نمایش مولفه‌های فـــــرم بر اساس وضعیت فرم تولید خودکار وب سرویس
          </li>
          <li>
            دریافــــت و ارسال اطلاعــات مربوط به هر فرم جهت ارتباط با سایر
            سامانه
          </li>
          <li>
            ها امکان ثبت اطلاعــــات و بازبینی ســــوابق فرم ها در رابط کاربری
          </li>
          <li>
            موبایل امکان تعریف محدوده و شرط برای هر فیلد در زمـــان ورود اطلاعات
          </li>
          <li>
            فرم جلوگیری از ثبت داده تکراری بر اســـاس فیلدهای مشخص شده برای هر
            فرم
          </li>
          <li>
            امکان جســـــتجوی اطلاعـــــات و مشخـــص بودن ســابقه ثبت،ویرایش و
            حذف
          </li>
          <li>آنها امکان تعریف سـطوح دسترسی به فرم ها و فیلدهای هر فرم</li>
        </ul>
      </div>
      <div className="properties">
        <SectionProperties title={"ویژگی های کلیدی فرم ساز"} />
      </div>
    </div>
  );
};

export default FormBuilder;
